#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.aws_iam_policy_document.amplify: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.amplify: Read complete after 0s [id=3761455492][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_amplify_app.application[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_amplify_app" "application" {
      [32m+[0m [0m[1m[0maccess_token[0m[0m                = (sensitive value)
      [32m+[0m [0m[1m[0marn[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mbuild_spec[0m[0m                  = <<-EOT
            version: 1
            frontend:
              phases:
                preBuild:
                  commands:
                    - npm install
                build:
                  commands:
                    - npm run build
              artifacts:
                baseDirectory: dist
                files:
                  - '**/*'
              cache:
                paths:
                  - node_modules/**/*
        EOT
      [32m+[0m [0m[1m[0mdefault_domain[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0menable_auto_branch_creation[0m[0m = true
      [32m+[0m [0m[1m[0menable_branch_auto_build[0m[0m    = true
      [32m+[0m [0m[1m[0menable_branch_auto_deletion[0m[0m = true
      [32m+[0m [0m[1m[0miam_service_role_arn[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "ignite"
      [32m+[0m [0m[1m[0mplatform[0m[0m                    = "WEB"
      [32m+[0m [0m[1m[0mproduction_branch[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mrepository[0m[0m                  = "https://github.com/roremdev/Ignite"
      [32m+[0m [0m[1m[0mtags[0m[0m                        = {
          [32m+[0m [0m"application" = "ignite"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                    = {
          [32m+[0m [0m"application" = "ignite"
        }

      [32m+[0m [0mauto_branch_creation_config {
          [32m+[0m [0m[1m[0mbasic_auth_credentials[0m[0m        = (sensitive value)
          [32m+[0m [0m[1m[0mbuild_spec[0m[0m                    = (known after apply)
          [32m+[0m [0m[1m[0menable_auto_build[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0menable_basic_auth[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0menable_performance_mode[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0menable_pull_request_preview[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0menvironment_variables[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mframework[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mpull_request_environment_name[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mstage[0m[0m                         = (known after apply)
        }

      [32m+[0m [0mcustom_rule {
          [32m+[0m [0m[1m[0msource[0m[0m = "/<*>"
          [32m+[0m [0m[1m[0mstatus[0m[0m = "404"
          [32m+[0m [0m[1m[0mtarget[0m[0m = "/index.html"
        }
    }

[1m  # aws_amplify_branch.environment[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_amplify_branch" "environment" {
      [32m+[0m [0m[1m[0mapp_id[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0marn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0massociated_resources[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mbranch_name[0m[0m           = "feat/issue-34/dashboard"
      [32m+[0m [0m[1m[0mcustom_domains[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mdestination_branch[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m          = "dashboard"
      [32m+[0m [0m[1m[0menable_auto_build[0m[0m     = true
      [32m+[0m [0m[1m[0menvironment_variables[0m[0m = {
          [32m+[0m [0m"MODE" = "feature"
        }
      [32m+[0m [0m[1m[0mframework[0m[0m             = "React"
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0msource_branch[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mstage[0m[0m                 = "PULL_REQUEST"
      [32m+[0m [0m[1m[0mtags_all[0m[0m              = (known after apply)
    }

[1m  # aws_iam_role.amplify[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role" "amplify" {
      [32m+[0m [0m[1m[0marn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0massume_role_policy[0m[0m    = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = "sts:AssumeRole"
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mService = "amplify.amazonaws.com"
                        }
                      [32m+[0m [0mSid       = ""
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mcreate_date[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mforce_detach_policies[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mmanaged_policy_arns[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mmax_session_duration[0m[0m  = 3600
      [32m+[0m [0m[1m[0mname[0m[0m                  = "amplify"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpath[0m[0m                  = "/"
      [32m+[0m [0m[1m[0mtags_all[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0munique_id[0m[0m             = (known after apply)

      [32m+[0m [0minline_policy {
          [32m+[0m [0m[1m[0mname[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mpolicy[0m[0m = (known after apply)
        }
    }

[0m[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [32m+[0m [0m[1m[0mamplify[0m[0m             = {
      [32m+[0m [0mdomain = (known after apply)
      [32m+[0m [0mname   = "ignite"
    }
  [32m+[0m [0m[1m[0mamplify_environment[0m[0m = {
      [32m+[0m [0mdestination_branch = (known after apply)
      [32m+[0m [0mdomain             = (known after apply)
      [32m+[0m [0msource_branch      = (known after apply)
    }
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @roremdev, Action: `issues*